-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-06-26 04:38:32
-- 伺服器版本： 10.4.13-MariaDB
-- PHP 版本： 7.2.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `trip`
--

-- --------------------------------------------------------

--
-- 資料表結構 `all_data`
--

CREATE TABLE `all_data` (
  `id` int(11) NOT NULL,
  `date` date NOT NULL,
  `title` text NOT NULL,
  `trip_date` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `all_set` int(11) NOT NULL,
  `sale_set` int(11) NOT NULL,
  `country` int(11) NOT NULL,
  `company` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `all_data`
--

INSERT INTO `all_data` (`id`, `date`, `title`, `trip_date`, `price`, `all_set`, `sale_set`, `country`, `company`) VALUES
(34, '2020-06-26', '嗨翻沖繩~海洋博公園、古宇利大橋、美國村四天【亞洲航空】', 4, 19900, 20, 20, 1, 1),
(35, '2020-06-27', '沖繩等等我~浪漫海岸、古宇利大橋、美國村四天【虎航】', 4, 20900, 18, 18, 1, 1),
(36, '2020-06-27', '虎航沖繩玩粉大豪華版4日(升等一晚海邊渡假酒店)', 4, 24000, 18, 18, 1, 1),
(37, '2020-06-27', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 35900, 33, 32, 1, 1),
(38, '2020-06-29', '亞航享戀沖繩~海洋博公園、瀨長島五天【桃園直飛、亞洲航空】', 5, 21900, 20, 20, 1, 1),
(39, '2020-07-01', '特惠促銷『驚喜關西』京阪神奈+環球影城暢遊四都五日', 5, 23900, 29, 28, 1, 1),
(40, '2020-07-01', '京阪神奈+和服體驗+環球影城暢遊四都五日', 5, 27900, 29, 28, 1, 1),
(41, '2020-07-01', '關西四都世界文化遺產+環球影城六日-亞航', 6, 31900, 35, 34, 1, 1),
(42, '2020-07-01', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 33900, 25, 24, 1, 1),
(43, '2020-07-01', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 33900, 25, 24, 1, 1),
(44, '2020-07-01', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 35900, 33, 32, 1, 1),
(45, '2020-07-02', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(46, '2020-07-02', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(47, '2020-07-03', '特惠促銷『驚喜關西』京阪神奈+環球影城暢遊四都五日', 5, 23900, 29, 28, 1, 1),
(48, '2020-07-03', '京阪神奈+和服體驗+環球影城暢遊四都五日', 5, 27900, 29, 28, 1, 1),
(49, '2020-07-03', '關西四都+世界文化遺產環球影城五日-亞航', 5, 27900, 35, 34, 1, 1),
(50, '2020-07-04', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 35900, 33, 32, 1, 1),
(51, '2020-07-05', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 32900, 25, 24, 1, 1),
(52, '2020-07-05', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 32900, 25, 24, 1, 1),
(53, '2020-07-05', '京阪神奈良四都+環球影城五日-國泰', 5, 33900, 28, 27, 1, 1),
(54, '2020-07-05', '北海道富良野哈密瓜吃到飽溫泉美食六日(馬印)', 6, 38900, 26, 25, 1, 1),
(55, '2020-07-06', '特惠促銷『驚喜關西』京阪神奈+環球影城暢遊四都五日', 5, 22900, 29, 28, 1, 1),
(56, '2020-07-06', '京阪神奈+和服體驗+環球影城暢遊四都五日', 5, 26900, 29, 28, 1, 1),
(57, '2020-07-06', '關西四都+世界文化遺產環球影城五日-亞航', 5, 27900, 35, 34, 1, 1),
(58, '2020-07-07', '特惠促銷『驚喜關西』京阪神奈+環球影城暢遊四都五日', 5, 22900, 29, 28, 1, 1),
(59, '2020-07-07', '京阪神奈+和服體驗+環球影城暢遊四都五日', 5, 26900, 29, 28, 1, 1),
(60, '2020-07-07', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(61, '2020-07-07', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(62, '2020-07-08', '京阪神奈+和服體驗+環球影城暢遊四都五日', 5, 27900, 29, 28, 1, 1),
(63, '2020-07-08', '關西四都世界文化遺產+環球影城六日-亞航', 6, 31900, 35, 34, 1, 1),
(64, '2020-07-08', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 33900, 25, 24, 1, 1),
(65, '2020-07-08', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 33900, 25, 24, 1, 1),
(66, '2020-07-08', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 35900, 33, 32, 1, 1),
(67, '2020-07-09', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(68, '2020-07-09', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(69, '2020-07-10', '特惠促銷『驚喜關西』京阪神奈+環球影城暢遊四都五日', 5, 23900, 29, 28, 1, 1),
(70, '2020-07-10', '京阪神奈+和服體驗+環球影城暢遊四都五日', 5, 27900, 29, 28, 1, 1),
(71, '2020-07-10', '關西四都+世界文化遺產環球影城五日-亞航', 5, 27900, 35, 34, 1, 1),
(72, '2020-07-11', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 35900, 33, 32, 1, 1),
(73, '2020-07-12', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 32900, 25, 24, 1, 1),
(74, '2020-07-12', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 32900, 25, 24, 1, 1),
(75, '2020-07-12', '京阪神奈良四都+環球影城五日-國泰', 5, 33900, 28, 27, 1, 1),
(76, '2020-07-12', '北海道富良野哈密瓜吃到飽溫泉美食六日(馬印)', 6, 38900, 26, 25, 1, 1),
(77, '2020-07-13', '關西四都+世界文化遺產環球影城五日-亞航', 5, 29900, 35, 34, 1, 1),
(78, '2020-07-14', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(79, '2020-07-14', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 32900, 25, 24, 1, 1),
(80, '2020-07-15', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(81, '2020-07-15', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 35900, 33, 32, 1, 1),
(82, '2020-07-15', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(83, '2020-07-16', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(84, '2020-07-16', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(85, '2020-07-17', '關西四都+世界文化遺產環球影城五日-亞航', 5, 29900, 35, 34, 1, 1),
(86, '2020-07-18', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 35900, 33, 32, 1, 1),
(87, '2020-07-19', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(88, '2020-07-19', '京阪神奈良四都+環球影城五日-國泰', 5, 35900, 28, 27, 1, 1),
(89, '2020-07-19', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(90, '2020-07-19', '北海道富良野哈密瓜吃到飽溫泉美食六日(馬印)', 6, 40900, 26, 25, 1, 1),
(91, '2020-07-20', '關西四都+世界文化遺產環球影城五日-亞航', 5, 28900, 35, 34, 1, 1),
(92, '2020-07-21', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 36900, 25, 24, 1, 1),
(93, '2020-07-21', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 36900, 25, 24, 1, 1),
(94, '2020-07-22', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 37900, 25, 24, 1, 1),
(95, '2020-07-22', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 37900, 25, 24, 1, 1),
(96, '2020-07-22', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 40900, 33, 32, 1, 1),
(97, '2020-07-23', '仲夏洞爺花火節+薰衣草花田六日', 6, 33900, 32, 31, 1, 1),
(98, '2020-07-23', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 36900, 25, 24, 1, 1),
(99, '2020-07-23', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 36900, 25, 24, 1, 1),
(100, '2020-07-24', '關西四都+世界文化遺產環球影城五日-亞航', 5, 29900, 35, 34, 1, 1),
(101, '2020-07-25', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 38900, 33, 32, 1, 1),
(102, '2020-07-26', '京阪神奈良四都+環球影城五日-國泰', 5, 33900, 28, 27, 1, 1),
(103, '2020-07-26', '北海道富良野哈密瓜吃到飽溫泉美食六日(馬印)', 6, 41900, 26, 25, 1, 1),
(104, '2020-07-27', '關西四都+世界文化遺產環球影城五日-亞航', 5, 28900, 35, 34, 1, 1),
(105, '2020-07-28', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(106, '2020-07-28', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(107, '2020-07-29', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(108, '2020-07-29', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(109, '2020-07-29', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 38900, 33, 32, 1, 1),
(110, '2020-07-30', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(111, '2020-07-30', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(112, '2020-08-01', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 38900, 26, 25, 1, 1),
(113, '2020-08-02', '仲夏洞爺花火節+薰衣草花田五日', 5, 31900, 32, 31, 1, 1),
(114, '2020-08-02', '京阪神奈良四都+環球影城五日-國泰', 5, 33900, 28, 27, 1, 1),
(115, '2020-08-02', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(116, '2020-08-02', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(117, '2020-08-02', '北海道富良野哈密瓜吃到飽溫泉美食五日(酷航)', 5, 37900, 29, 28, 1, 1),
(118, '2020-08-02', '北海道富良野哈密瓜吃到飽溫泉美食六日(馬印)', 6, 41900, 26, 25, 1, 1),
(119, '2020-08-04', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(120, '2020-08-04', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(121, '2020-08-05', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(122, '2020-08-05', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 35900, 25, 24, 1, 1),
(123, '2020-08-05', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 38900, 33, 32, 1, 1),
(124, '2020-08-06', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 36900, 25, 24, 1, 1),
(125, '2020-08-06', '靜岡大井川鐵道伊豆半島掛川花鳥園‧大室山纜車‧櫻桃小丸子‧伊豆浪漫列車.富士山溫泉六日(星悅)', 6, 36900, 25, 24, 1, 1),
(126, '2020-08-07', '關西四都+世界文化遺產環球影城五日-亞航', 5, 29900, 35, 34, 1, 1),
(127, '2020-08-08', '北海道富良野哈密瓜吃到飽溫泉美食五日(馬印)', 5, 40900, 33, 32, 1, 1),
(128, '2020-08-09', '九州豪斯登堡+柳川遊船旅人電車溫泉五日(星悅)', 5, 32900, 25, 24, 1, 1),
(129, '2020-08-09', '南北九州萌熊電鐵.熊本城彩苑˙別府海地獄˙門司港˙櫻島火山+宮崎鹿兒島溫泉五日(星悅)', 5, 32900, 25, 24, 1, 1),
(130, '2020-08-09', '京阪神奈良四都+環球影城五日-國泰', 5, 33900, 28, 27, 1, 1),
(131, '2020-08-09', '北海道富良野哈密瓜吃到飽溫泉美食六日(馬印)', 6, 43900, 26, 25, 1, 1),
(132, '2020-08-10', '關西四都+世界文化遺產環球影城五日-亞航', 5, 29900, 35, 34, 1, 1),
(133, '2020-08-11', '立山黑部+黑部峽谷鐵道・上高地・河童橋・長島OUTLET・郡上八幡散策・白川鄉合掌村・兼六園溫泉六日(星悅)', 6, 34900, 25, 24, 1, 1),
(134, '2020-08-01', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(135, '2020-08-01', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(136, '2020-08-02', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園螃蟹美食三溫泉 五日遊(函館/函館)', 5, 36900, 36, 35, 1, 2),
(137, '2020-08-04', '【風采旅遊】愛戀北海道  道東秘境 紫色花見~薰衣草 美食溫泉 五日遊(旭/旭)', 5, 35900, 26, 25, 1, 2),
(138, '2020-08-05', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(139, '2020-08-05', '【旗艦東瀛】關東暑期樂逍遙‧東京迪士尼.大洗磯前神社.筑波山纜車.淺草寺夏日樂遊‧魅力關東五日', 5, 35900, 28, 27, 1, 2),
(140, '2020-08-05', '【旗艦東瀛】關東伊豆風呂‧米其林三星景點~高尾山.忍野八海.小田原城.櫻井製茶園採茶趣傳奇富士‧夏日風情 五日', 5, 36900, 28, 27, 1, 2),
(141, '2020-08-05', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(142, '2020-08-07', '【旗艦東瀛】深度京阪‧渡月橋.寧夏納涼貴船神社.大阪城公園.近江La Collina漫步古都半自助關西漫遊‧優質五日', 5, 31900, 28, 27, 1, 2),
(143, '2020-08-07', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園  螃蟹美食溫泉 五日遊(函館/旭川)', 5, 37900, 26, 25, 1, 2),
(144, '2020-08-07', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 37900, 28, 27, 1, 2),
(145, '2020-08-07', '【旗艦東瀛】關東暑期樂逍遙‧東京迪士尼.大洗磯前神社.筑波山纜車.淺草寺夏日樂遊‧魅力關東五日', 5, 37900, 28, 27, 1, 2),
(146, '2020-08-07', '【旗艦東瀛】關東伊豆風呂‧米其林三星景點~高尾山.忍野八海.小田原城.櫻井製茶園採茶趣傳奇富士‧夏日風情 五日', 5, 38900, 28, 27, 1, 2),
(147, '2020-08-07', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 41900, 28, 27, 1, 2),
(148, '2020-08-08', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園  螃蟹美食溫泉 五日遊(函館/旭川)', 5, 37900, 26, 25, 1, 2),
(149, '2020-08-08', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 37900, 28, 27, 1, 2),
(150, '2020-08-08', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 41900, 28, 27, 1, 2),
(151, '2020-08-08', '【元氣日本】奧入瀨星野之宿～秘享睡魔暖湯延養5日', 5, 75900, 35, 34, 1, 2),
(152, '2020-08-09', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園螃蟹美食三溫泉 五日遊(函館/函館)', 5, 37900, 36, 35, 1, 2),
(153, '2020-08-11', '【風采旅遊】愛戀北海道  道東秘境 紫色花見~薰衣草 美食溫泉 五日遊(旭/旭)', 5, 37900, 26, 25, 1, 2),
(154, '2020-08-12', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(155, '2020-08-12', '【旗艦東瀛】關東暑期樂逍遙‧東京迪士尼.大洗磯前神社.筑波山纜車.淺草寺夏日樂遊‧魅力關東五日', 5, 35900, 28, 27, 1, 2),
(156, '2020-08-12', '【旗艦東瀛】關東伊豆風呂‧米其林三星景點~高尾山.忍野八海.小田原城.櫻井製茶園採茶趣傳奇富士‧夏日風情 五日', 5, 36900, 28, 27, 1, 2),
(157, '2020-08-12', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園螃蟹美食三溫泉 五日遊(函館/函館)', 5, 38900, 36, 35, 1, 2),
(158, '2020-08-12', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(159, '2020-08-14', '【旗艦東瀛】深度京阪‧渡月橋.寧夏納涼貴船神社.大阪城公園.近江La Collina漫步古都半自助關西漫遊‧優質五日', 5, 29900, 28, 27, 1, 2),
(160, '2020-08-14', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(161, '2020-08-14', '【旗艦東瀛】關東暑期樂逍遙‧東京迪士尼.大洗磯前神社.筑波山纜車.淺草寺夏日樂遊‧魅力關東五日', 5, 35900, 28, 27, 1, 2),
(162, '2020-08-14', '【旗艦東瀛】關東伊豆風呂‧米其林三星景點~高尾山.忍野八海.小田原城.櫻井製茶園採茶趣傳奇富士‧夏日風情 五日', 5, 36900, 28, 27, 1, 2),
(163, '2020-08-14', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園  螃蟹美食溫泉 五日遊(函館/旭川)', 5, 37900, 26, 25, 1, 2),
(164, '2020-08-14', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(165, '2020-08-15', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(166, '2020-08-15', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園  螃蟹美食溫泉 五日遊(函館/旭川)', 5, 37900, 26, 25, 1, 2),
(167, '2020-08-15', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(168, '2020-08-15', '【元氣日本】奧入瀨星野之宿～秘享睡魔暖湯延養5日', 5, 69900, 35, 34, 1, 2),
(169, '2020-08-16', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園螃蟹美食三溫泉 五日遊(函館/函館)', 5, 36900, 36, 35, 1, 2),
(170, '2020-08-18', '【風采旅遊】愛戀北海道  道東秘境 紫色花見~薰衣草 美食溫泉 五日遊(旭/旭)', 5, 35900, 26, 25, 1, 2),
(171, '2020-08-19', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(172, '2020-08-19', '【旗艦東瀛】關東暑期樂逍遙‧東京迪士尼.大洗磯前神社.筑波山纜車.淺草寺夏日樂遊‧魅力關東五日', 5, 35900, 28, 27, 1, 2),
(173, '2020-08-19', '【旗艦東瀛】關東伊豆風呂‧米其林三星景點~高尾山.忍野八海.小田原城.櫻井製茶園採茶趣傳奇富士‧夏日風情 五日', 5, 36900, 28, 27, 1, 2),
(174, '2020-08-19', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園螃蟹美食三溫泉 五日遊(函館/函館)', 5, 37900, 36, 35, 1, 2),
(175, '2020-08-19', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(176, '2020-08-21', '【旗艦東瀛】深度京阪‧渡月橋.寧夏納涼貴船神社.大阪城公園.近江La Collina漫步古都半自助關西漫遊‧優質五日', 5, 29900, 28, 27, 1, 2),
(177, '2020-08-21', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(178, '2020-08-21', '【旗艦東瀛】關東暑期樂逍遙‧東京迪士尼.大洗磯前神社.筑波山纜車.淺草寺夏日樂遊‧魅力關東五日', 5, 35900, 28, 27, 1, 2),
(179, '2020-08-21', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園  螃蟹美食溫泉 五日遊(函館/旭川)', 5, 36900, 26, 25, 1, 2),
(180, '2020-08-21', '【旗艦東瀛】關東伊豆風呂‧米其林三星景點~高尾山.忍野八海.小田原城.櫻井製茶園採茶趣傳奇富士‧夏日風情 五日', 5, 36900, 28, 27, 1, 2),
(181, '2020-08-21', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(182, '2020-08-22', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(183, '2020-08-22', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園  螃蟹美食溫泉 五日遊(函館/旭川)', 5, 36900, 26, 25, 1, 2),
(184, '2020-08-22', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(185, '2020-08-22', '【元氣日本】奧入瀨星野之宿～秘享睡魔暖湯延養5日', 5, 69900, 35, 34, 1, 2),
(186, '2020-08-23', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園螃蟹美食三溫泉 五日遊(函館/函館)', 5, 36900, 36, 35, 1, 2),
(187, '2020-08-25', '【風采旅遊】愛戀北海道  道東秘境 紫色花見~薰衣草 美食溫泉 五日遊(旭/旭)', 5, 35900, 26, 25, 1, 2),
(188, '2020-08-26', '【旗艦東瀛】夏之風物詩‧立山黑部.上高地.金澤兼六園. 名古屋城初夏雲遊‧饗食美湯‧優質五日', 5, 35900, 28, 27, 1, 2),
(189, '2020-08-26', '【旗艦東瀛】關東暑期樂逍遙‧東京迪士尼.大洗磯前神社.筑波山纜車.淺草寺夏日樂遊‧魅力關東五日', 5, 35900, 28, 27, 1, 2),
(190, '2020-08-26', '【旗艦東瀛】關東伊豆風呂‧米其林三星景點~高尾山.忍野八海.小田原城.櫻井製茶園採茶趣傳奇富士‧夏日風情 五日', 5, 36900, 28, 27, 1, 2),
(191, '2020-08-26', '【風采旅遊】愛戀北海道 浪漫小樽 紫色花見~薰衣草 尼克斯海洋公園螃蟹美食三溫泉 五日遊(函館/函館)', 5, 37900, 36, 35, 1, 2),
(192, '2020-08-26', '【旗鑑東瀛】北陸仲夏夜‧立山黑部.上高地.白川鄉合掌村.飛驒原鄉樂活逍遙五日', 5, 39900, 28, 27, 1, 2),
(193, '2020-08-28', '【旗艦東瀛】深度京阪‧渡月橋.寧夏納涼貴船神社.大阪城公園.近江La Collina漫步古都半自助關西漫遊‧優質五日', 5, 29900, 28, 27, 1, 2);

-- --------------------------------------------------------

--
-- 資料表結構 `company`
--

CREATE TABLE `company` (
  `id` int(11) NOT NULL,
  `company` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `company`
--

INSERT INTO `company` (`id`, `company`) VALUES
(1, '新魅力旅遊'),
(2, '世邦旅遊');

-- --------------------------------------------------------

--
-- 資料表結構 `country`
--

CREATE TABLE `country` (
  `id` int(11) NOT NULL,
  `country` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `country`
--

INSERT INTO `country` (`id`, `country`) VALUES
(1, '日本');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `all_data`
--
ALTER TABLE `all_data`
  ADD PRIMARY KEY (`id`),
  ADD KEY `country` (`country`),
  ADD KEY `company` (`company`);

--
-- 資料表索引 `company`
--
ALTER TABLE `company`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `country`
--
ALTER TABLE `country`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `all_data`
--
ALTER TABLE `all_data`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=194;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `company`
--
ALTER TABLE `company`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `country`
--
ALTER TABLE `country`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `all_data`
--
ALTER TABLE `all_data`
  ADD CONSTRAINT `all_data_ibfk_1` FOREIGN KEY (`company`) REFERENCES `company` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `all_data_ibfk_2` FOREIGN KEY (`country`) REFERENCES `country` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
